# решено вынести в templates, так как статья будет одна
def build_help_telegraph() -> str:
    return """
<p><b><blockquote>📌 Информация:</blockquote></b></p> 

<p>• Бот — @BlaZeV2_Bot</p>
<p>• Разработчик — @blazevx</p>
<p>• Telegram канал разработчика — @blazevx_self</p>
<p>• Особая благодарность: @skandersim — за то, что всегда был рядом и помогал мне двигаться дальше.</p>

<hr>

<p>Проект находится в активной разработке.</p>

<p>Вдохновлён ботом @chestor. Он является основным источником, откуда я брал идеи и механики для проекта. Я брал существующие механики и переписывал их под себя своим кодом. Я не пытаюсь сделать вид, что всё это придумано мной, но при этом проект не был просто скопирован.</p>

<p>Основная цель проекта — создать полноценную RPG-систему внутри Telegram с механиками и атмосферой Tokyo Ghoul.</p>

<p>Разработка продолжается практически ежедневно.</p>

<hr>

<p>Автор будет рад услышать ваше мнение о боте и поддержит ваши идеи!</p>

<p><b>Спасибо за прочтение.</b></p>

<hr>

<p><b><blockquote>ℹ️ Содержание:</blockquote></b></p>
<p>1. Команды пользователей</p>
<p>2. Команды гулей</p>
<p>3. Команды групп</p>

<hr>

<p><b><blockquote>👤 Команды пользователей:</blockquote></b></p>
<p>• /start — Показывает стартовое сообщение с небольшой навигацией. Регистрирует вас в боте.</p>
<p>• /help — Команда с ссылками на эту статью и каналами.</p>
<p>• /quiz — Викторина по фандому аниме «Токийский гуль» с выбором ответов. Установлен лимит на 15 вопросов в день, лимит сбрасывается после 00:00 (Фарм валюты BlazeCoin)</p>
<p>• Бот — Отвечает пользователю одной случайной фразой</p>
<p>• Нейросеть — Если ответить реплаем на любое сообщение бота, он ответит вам с помощью нейросети. Бот видит, на какое своё сообщение вы ответили, поэтому с ним можно вести диалог. Проще всего начать так: написать «бот» и ответить на его сообщение. Бот отвечает грубо, дерзко и с матом — это его характер. Имеет пару ограничений:</p>
    <p>1) Один вопрос раз в 10 секунд на человека. Если писать чаще, бот просто промолчит.</p>
    <p>2) Есть общий дневной лимит запросов. Если он закончился, бот продолжит отвечать на следующий день.</p>
<p>• Топ балик — Выдаёт список самых богатых гулей по валюте.</p>
<p>• Неизвестные команды через - '/' — Бот ответит вам сообщением с кнопкой в виде ссылки на эту статью, напоминая вам, что такой команды не существует)</p>
<p>• Профиль — Показывает обычный профиль пользователя с возможностью сразу переключиться на расовый профиль игрока. В чатах, в профиле - отображается блок в этом чате где находится небольшая статистика участника</p>
<p>• Балик — Позволяет посмотреть свой баланс внутриигровой валюты BlazeCoin</p>
<p>• /wordle или же Вротли — Игра в слова. Нужно угадать слово из 5 букв (Фарм валюты BlaZeCoin). После выигрыша или проигрыша бот покажет значение того или иного слова отдельным сообщением.</p>
<p>• Депнуть — Лотерея(подобие казино). Игрок должен выбрать цвет (всего цветов - 5), а так же установить сумму ставки (100-1000000). Если цвет совпал с выбранным, ставка умножается на соответствующий множитель и игрок получает внутриигровую валюту. В остальных случаях валюта отнимается.</p>
<p>• Перевести/кинуть/подать — Позволяет игрокам переводить внутриигровую валюту BlaZeCoin между собой. Имеет пару ограничений:</p>
    <p>1) С момента регистрации в боте, игроку нельзя переводить валюту в течение 3 дней.</p>
    <p>2) Валюту нельзя перевести самому себе.</p> 
    <p>3) На одного игрока осуществляется до 15 переводов в течение 24 часов.</p>

<hr>

<p><b><blockquote>🧬 Команды гулей:</blockquote></b></p>
<p>• Щёлк — Даёт небольшое кол-во BlazeCoin. (Фарм валюты BlaZeCoin)</p>
<p>• Растить кагуне — Команда, которая даёт первое кагуне игроку. Всего типов - 4, какой выпадет именно вам решает рандом с определённым процентом. Команда позволяет вам его улучшать за BlazeCoin и каждый тип имеет свои механики и бафы</p>
<p>• Пить кофе — Так же даёт небольшое кол-во BlazeCoin, но имеет пару особенностей:</p>
    <p>1) Чтобы использовать эту команду, игрок должен щелкнуть пальцами 100 раз(с помощью команды <b>«Щёлк»</b>)</p>
    <p>2) Ограничение по времени команда сама по себе не имеет, однако если вы выпьете слишком много кофе, вы словите передоз и не сможете воспользоваться командой следующие 5 часов</p> 
<p>• Топ щелк — Выдаёт список гулей по количеству сломанных пальцев</p>
<p>• Топ кагуне — Выдаёт список самых сильнейших гулей по уровню(силе) кагуне</p>
<p>• Топ кофе — Выдаёт список гулей по количеству выпитого кофе</p>
<p>• Распрофиль — Показывает расовый профиль гуля с возможностью переключиться на обычный профиль через кнопку</p>
<p>• Качаться — Присылает сообщение прокачки статов с интерактивным меню и прокачивает характеристики игрока. Команда доступна в лс для лаконичности и чтобы не сломать логику бота. Ограничений по времени не имеет. Команда влияет на другие механики игры</p>

<hr>

<p><b><blockquote>☕️ Команды групп:</blockquote></b></p>
<p>• Правила — Показывает правила группы для всех участников чата. По дефолту правила отсутствуют (Администраторам или создателю чата потребуется их установить с помощью команды -> новые правила)</p>
<p>• Новые правила — Позволяет администраторам или создателю группы устанавливать правила для участников чата (Имейте в виду, что вы можете к существующему списку правил добавлять новые правила группы (будьте внимательны, так как новые правила устанавливаются всегда в конец списка). )</p>
<p>• Удалить правила — Позволяет администраторам или создателю группы удалить текущий список правил. (Также имейте в виду, что пока эта команда удаляет весь список установленных правил.)</p>
<p>• Новое приветствие — Позволяет администраторам или создателю группы установить приветственный текст для участников чата. (Вы можете установить ИМЯ в приветствие и прощании для участника, пример: новое прощание Привет {name}!)</p>
<p>• Новое прощание — Позволяет администраторам или создателю группы установить прощальный текст для участников чата.</p>
<p>• /set_rp — Позволяет участникам чата создавать собственные рп-команды. При необходимости к команде можно прикрепить фото, анимацию или GIF. В чате можно устанавливать до 20 команд</p>
<p>• /all_rp — Отображает весь список рп-команд, установленных в чате</p>
<p>• /del_rp — Позволяет пользователям удалить рп-команду установленную ранее</p>
<p>• /admins — Показывает участникам чата список администраторов включая создателя группы</p>
<p>• /report — Позволяет участникам чата пожаловаться на игрока. Уведомление для администраторов приходит прямо в чате в этом же сообщении</p>
<p>• /ban_chat — Позволяет администраторам группы с соответствующими правами блокировать пользователя в чате. Нужно указать срок, иначе - бан навсегда, а так же причину (по желанию)</p>
<p>• /unban_chat — Позволяет администраторам группы снять блокировку пользователя если тот находится в бане</p>
<p>• /kick_chat — Позволяет администраторам группы исключать участников с чата. По желанию можно указать причину кика</p>
<p>• /mute_chat — Позволяет администраторам группы мутить участников чата. Нужно указать срок, иначе - мут навсегда, а так же причину (по желанию)</p>
<p>• /unmute_chat — Позволяет администраторам группы снять мут с участника если тот находится в муте</p>
<p>• /warn_chat — Позволяет администраторам группы выдавать предупреждения пользователю. Всего предупреждений можно выдать - 3. После достижения лимита - предупреждения сбрасываются и администратору нужно решить, что сделать с пользователем: забанить, замутить, кикнуть или ничего с ним не делать</p>
<p>• /history_moder — Позволяет администраторам смотреть историю другого администратора и все его последние действия над пользователем</p>
<p>• Защита от спама — Бот автоматически следит за слишком частой отправкой сообщений. За флуд участник получает предупреждение, после 3 предупреждений — мут на 10 минут. Администрация под защиту не попадает</p>
<p>• Защита от ссылок — Если новый участник отправляет ссылку, сообщение удаляется, а участник получает предупреждение. За повторную или опасную ссылку (инвайты в другие чаты, сокращатели ссылок, файлы .apk и .exe) — мут на 10 часов. Если спам продолжится, участник будет исключён из группы. Активные участники чата и администрация под фильтр не попадают</p>
<p>• Фан-команды — Развлекательные команды, которые начинаются со слова «бот» и пишутся без слэша:</p>
    <p>1) Бот выбери участника — выбирает случайного участника чата</p>
    <p>2) Бот кто «вопрос» — выбирает участника, который подходит под вопрос. Пример: бот кто сегодня главный клоун</p>
    <p>3) Бот пара дня — составляет случайную пару из участников чата</p>
    <p>4) Бот топ «название» — составляет топ-5 участников по любой теме. Пример: бот топ красавчиков</p>
    <p>5) Бот выбери «вариант» или «вариант» — помогает определиться. Пример: бот выбери суши или пиццу</p>
    <p>6) Бот шанс / вероятность «вопрос» — показывает вероятность в процентах</p>
    <p>7) Бот насколько я «кто» — показывает, насколько вы подходите под описание. Пример: бот насколько я умный</p>
    <p>8) Бот оцени «что угодно» — ставит оценку от 0 до 10</p>
    <p>9) Бот сколько «вопрос» — называет число</p>
    <p>10) Бот когда «вопрос» — предсказывает дату</p>
    <p>11) Бот число «от» «до» — случайное число в диапазоне</p>
    <p>12) Бот монетка — орёл или решка</p>
    <p>13) Бот кубик — бросает кубик</p>
    <p>Шанс, оценка, «насколько я», «сколько», «когда» весь день выдают один и тот же результат на одинаковый вопрос.</p>

<hr>

<p><b>Заключение:</b></p>
<p>Сейчас проект всё ещё находится в активной разработке и постепенно обрастает новыми механиками.</p>

<p>За это время я уже успел несколько раз полностью переписать архитектуру, изменить структуру базы данных и переработать многие системы практически с нуля.</p>

<p>Впереди ещё много работы: новые команды, PvP-система, развитие персонажа, улучшение интерфейса и, возможно, даже Telegram Mini App.</p>

<p>Я не знаю, каким именно станет BlaZe | Bot через год, но знаю одно — я хочу продолжать его развивать и делать лучше с каждым обновлением.</p>
"""